namespace Task_20_04
{
    // Создайте программу для учета транспортных средств.Используйте перечисление VehicleType:
    //• Car
    //• Bike
    //• Bus
    //• Truck
    //• Motorcycle
    //Храните список транспортных средств (можно просто List<VehicleType>).
    // Добавьте метод для подсчёта транспорта определённого типа(например, сколько грузовиков).
    // Реализуйте поиск по типу и вывод информации.
    public enum VehicleType
    {
        Car,
        Bike,
        Bus,
        Truck,
        Motorcycle
    }
}
